vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT685S_DFP.pdsc
    <condition id="allOf.device=MIMXRT685S.internal_condition">
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.ak4497_adapter.condition_id">
      <require condition="allOf.device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.at_least_one_i2c_mux_device_enabled.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_mux_pca954x, device=MIMXRT685S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_mux_pca954x"/>
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.audio_flexcomm_i2s_dma_adapter.condition_id">
      <require condition="allOf.driver.flexcomm_i2s_dma, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexcomm_i2s_dma, device=MIMXRT685S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2s_dma"/>
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="device.MIMXRT633S.internal_condition">
      <accept Dname="MIMXRT633SFAWBR" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT633SFFOB" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT633SFVKB" Dvendor="NXP:11"/>
    </condition>
    <condition id="component.button.condition_id">
      <require condition="allOf.anyOf=allOf=component.lpc_gpio_adapter, driver.lpc_gpio, not=board=evkmimxrt685, not=board=mimxrt685audevk, allOf=anyOf=board=evkmimxrt685, mimxrt685audevk, driver.lpc_gpio, component.rt_gpio_adapter, component.timer_manager, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.lpc_gpio_adapter, driver.lpc_gpio, not=board=evkmimxrt685, not=board=mimxrt685audevk, allOf=anyOf=board=evkmimxrt685, mimxrt685audevk, driver.lpc_gpio, component.rt_gpio_adapter, component.timer_manager, device=MIMXRT685S.internal_condition">
      <require condition="anyOf.allOf=component.lpc_gpio_adapter, driver.lpc_gpio, not=board=evkmimxrt685, not=board=mimxrt685audevk, allOf=anyOf=board=evkmimxrt685, mimxrt685audevk, driver.lpc_gpio, component.rt_gpio_adapter.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.lpc_gpio_adapter, driver.lpc_gpio, not=board=evkmimxrt685, not=board=mimxrt685audevk, allOf=anyOf=board=evkmimxrt685, mimxrt685audevk, driver.lpc_gpio, component.rt_gpio_adapter.internal_condition">
      <accept condition="allOf.component.lpc_gpio_adapter, driver.lpc_gpio, not=board=evkmimxrt685, not=board=mimxrt685audevk.internal_condition"/>
      <accept condition="allOf.anyOf=board=evkmimxrt685, mimxrt685audevk, driver.lpc_gpio, component.rt_gpio_adapter.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpc_gpio_adapter, driver.lpc_gpio, not=board=evkmimxrt685, not=board=mimxrt685audevk.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_gpio_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require condition="not.board=evkmimxrt685.internal_condition"/>
      <require condition="not.board=mimxrt685audevk.internal_condition"/>
    </condition>
    <condition id="not.board=evkmimxrt685.internal_condition">
      <deny condition="board.evkmimxrt685.internal_condition"/>
    </condition>
    <condition id="board.evkmimxrt685.internal_condition">
      <accept condition="device.MIMXRT633S.internal_condition"/>
      <accept condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="not.board=mimxrt685audevk.internal_condition">
      <deny condition="board.mimxrt685audevk.internal_condition"/>
    </condition>
    <condition id="board.mimxrt685audevk.internal_condition">
      <accept condition="device.MIMXRT633S.internal_condition"/>
      <accept condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=board=evkmimxrt685, mimxrt685audevk, driver.lpc_gpio, component.rt_gpio_adapter.internal_condition">
      <require condition="anyOf.board=evkmimxrt685, mimxrt685audevk, driver.lpc_gpio.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rt_gpio_adapter"/>
    </condition>
    <condition id="anyOf.board=evkmimxrt685, mimxrt685audevk, driver.lpc_gpio.internal_condition">
      <accept condition="board.evkmimxrt685, mimxrt685audevk.internal_condition"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
    </condition>
    <condition id="board.evkmimxrt685, mimxrt685audevk.internal_condition">
      <accept condition="device.MIMXRT633S.internal_condition"/>
      <accept condition="device.MIMXRT685S.internal_condition"/>
      <accept condition="device.MIMXRT633S.internal_condition"/>
      <accept condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.cmsis_drivers.condition_id">
      <require condition="allOf.device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.codec_adapters.condition_id">
      <require condition="allOf.device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.codec_i2c.condition_id">
      <require condition="allOf.component.i2c_adapter_interface, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_adapter_interface, device=MIMXRT685S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface"/>
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.cs42448_adapter.condition_id">
      <require condition="allOf.device=MIMXRT685S.internal_condition"/>
    </condition>
