vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT685S_DFP.pdsc
    <condition id="allOf.component.lists, device=MIMXRT685S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.i3c_bus_adapter.condition_id">
      <require condition="allOf.component.i3c_bus, driver.i3c, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.component.i3c_bus, driver.i3c, device=MIMXRT685S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c_bus"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c"/>
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.led.condition_id">
      <require condition="allOf.anyOf=allOf=component.lpc_gpio_adapter, driver.lpc_gpio, component.timer_manager, driver.common, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.lpc_gpio_adapter, driver.lpc_gpio, component.timer_manager, driver.common, device=MIMXRT685S.internal_condition">
      <require condition="anyOf.allOf=component.lpc_gpio_adapter, driver.lpc_gpio.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.lpc_gpio_adapter, driver.lpc_gpio.internal_condition">
      <accept condition="allOf.component.lpc_gpio_adapter, driver.lpc_gpio.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpc_gpio_adapter, driver.lpc_gpio.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_gpio_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
    </condition>
    <condition id="component.lists.condition_id">
      <require condition="allOf.driver.common, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device=MIMXRT685S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.log.condition_id">
      <require condition="allOf.driver.common, utility.str, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, utility.str, device=MIMXRT685S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debug_console.condition_id">
      <require condition="allOf.component.log, driver.common, utility.debug_console, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.component.log, driver.common, utility.debug_console, device=MIMXRT685S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debug_console_lite.condition_id">
      <require condition="allOf.component.log, driver.common, utility.debug_console_lite, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.component.log, driver.common, utility.debug_console_lite, device=MIMXRT685S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.log.backend.ringbuffer.condition_id">
      <require condition="allOf.component.log, driver.common, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.component.log, driver.common, device=MIMXRT685S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.lpc_crc_adapter.condition_id">
      <require condition="allOf.driver.lpc_crc, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpc_crc, device=MIMXRT685S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_crc"/>
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.lpc_gpio_adapter.condition_id">
      <require condition="allOf.driver.inputmux, driver.lpc_gpio, driver.pint, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.inputmux, driver.lpc_gpio, driver.pint, device=MIMXRT685S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="pint"/>
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.lpcrtc.condition_id">
      <require condition="allOf.driver.lpc_rtc, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpc_rtc, device=MIMXRT685S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_rtc"/>
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.mem_manager.condition_id">
      <require condition="allOf.anyOf=component.mem_manager_legacy, component.mem_manager_light, component.lists, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=component.mem_manager_legacy, component.mem_manager_light, component.lists, device=MIMXRT685S.internal_condition">
      <require condition="anyOf.component.mem_manager_legacy, component.mem_manager_light.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="anyOf.component.mem_manager_legacy, component.mem_manager_light.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager_legacy"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager_light"/>
    </condition>
    <condition id="component.mem_manager_legacy.condition_id">
      <require condition="allOf.component.mem_manager, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.component.mem_manager, device=MIMXRT685S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager"/>
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
