vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT685S_DFP.pdsc
    <condition id="component.mem_manager_light.condition_id">
      <require condition="allOf.component.mem_manager, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.messaging.condition_id">
      <require condition="allOf.component.lists, component.mem_manager, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.component.lists, component.mem_manager, device=MIMXRT685S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mem_manager"/>
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.mflash_offchip.condition_id">
      <require condition="allOf.anyOf=driver.cache_cache64, driver.flexspi, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.cache_cache64, driver.flexspi, device=MIMXRT685S.internal_condition">
      <require condition="anyOf.driver.cache_cache64, driver.flexspi.internal_condition"/>
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.cache_cache64, driver.flexspi.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="cache_cache64"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi"/>
    </condition>
    <condition id="allOf.boards=mimxrt685audevk.condition_id">
      <require condition="boards.mimxrt685audevk.internal_condition"/>
    </condition>
    <condition id="boards.mimxrt685audevk.internal_condition">
      <accept condition="device.MIMXRT633S.internal_condition"/>
      <accept condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.boards=evkmimxrt685.condition_id">
      <require condition="boards.evkmimxrt685.internal_condition"/>
    </condition>
    <condition id="boards.evkmimxrt685.internal_condition">
      <accept condition="device.MIMXRT633S.internal_condition"/>
      <accept condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.mflash_onchip_fmu.condition_id">
      <require condition="allOf.device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.mpi_loader.condition_id">
      <require condition="allOf.device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.mrt_adapter.condition_id">
      <require condition="allOf.driver.mrt, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.mrt, device=MIMXRT685S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mrt"/>
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.nvm_adapter.condition_id">
      <require condition="allOf.device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.ostimer_adapter.condition_id">
      <require condition="allOf.driver.ostimer, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.driver.ostimer, device=MIMXRT685S.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ostimer"/>
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.panic.condition_id">
      <require condition="allOf.device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.pcm186x_adapter.condition_id">
      <require condition="allOf.device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.pcm512x_adapter.condition_id">
      <require condition="allOf.device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.power_manager_framework.condition_id">
      <require condition="allOf.anyOf=driver.common, component.lists, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.common, component.lists, device=MIMXRT685S.internal_condition">
      <require condition="anyOf.driver.common.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.common.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="component.pwm_ctimer_adapter.condition_id">
      <require condition="allOf.driver.ctimer, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.reset_adapter.condition_id">
      <require condition="allOf.device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.rng_adapter_interface.condition_id">
      <require condition="allOf.anyOf=allOf=component.trng_adapter, driver.trng, component.software_rng_adapter, device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.trng_adapter, driver.trng, component.software_rng_adapter, device=MIMXRT685S.internal_condition">
      <require condition="anyOf.allOf=component.trng_adapter, driver.trng, component.software_rng_adapter.internal_condition"/>
      <require condition="device.MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.trng_adapter, driver.trng, component.software_rng_adapter.internal_condition">
      <accept condition="allOf.component.trng_adapter, driver.trng.internal_condition"/>
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="software_rng_adapter"/>
    </condition>
    <condition id="allOf.component.trng_adapter, driver.trng.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="trng_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="trng"/>
    </condition>
    <condition id="component.rnga_adapter.condition_id">
      <require condition="allOf.device=MIMXRT685S.internal_condition"/>
    </condition>
    <condition id="component.rt_gpio_adapter.condition_id">
      <require condition="allOf.driver.lpc_gpio, device=MIMXRT685S.internal_condition"/>
    </condition>
