vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT685S_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="MIMXRT685S_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device MIMXRT685S_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, cores=cm33, device_ids=MIMXRT685S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT685S/arm/MIMXRT685Sxxxx_cm33_ram.scf" version="1.0.0" projectpath="MIMXRT685S/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, device_ids=MIMXRT685S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT685S/arm/MIMXRT685Sxxxx_cm33_flash.scf" version="1.0.0" projectpath="MIMXRT685S/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, device_ids=MIMXRT685S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT685S/arm/MIMXRT685Sxxxx_cm33_ram_s.scf" version="1.0.0" projectpath="MIMXRT685S/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, device_ids=MIMXRT685S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT685S/arm/MIMXRT685Sxxxx_cm33_flash_s.scf" version="1.0.0" projectpath="MIMXRT685S/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, device_ids=MIMXRT685S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT685S/arm/MIMXRT685Sxxxx_cm33_ram_ns.scf" version="1.0.0" projectpath="MIMXRT685S/arm"/>
        <file condition="allOf.toolchains=mdk, cores=cm33, device_ids=MIMXRT685S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT685S/arm/MIMXRT685Sxxxx_cm33_flash_ns.scf" version="1.0.0" projectpath="MIMXRT685S/arm"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, device_ids=MIMXRT685S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT685S/gcc/MIMXRT685Sxxxx_cm33_ram.ld" version="1.0.0" projectpath="MIMXRT685S/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, device_ids=MIMXRT685S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT685S/gcc/MIMXRT685Sxxxx_cm33_flash.ld" version="1.0.0" projectpath="MIMXRT685S/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, device_ids=MIMXRT685S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT685S/gcc/MIMXRT685Sxxxx_cm33_ram_s.ld" version="1.0.0" projectpath="MIMXRT685S/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, device_ids=MIMXRT685S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT685S/gcc/MIMXRT685Sxxxx_cm33_flash_s.ld" version="1.0.0" projectpath="MIMXRT685S/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, device_ids=MIMXRT685S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT685S/gcc/MIMXRT685Sxxxx_cm33_ram_ns.ld" version="1.0.0" projectpath="MIMXRT685S/gcc"/>
        <file condition="allOf.toolchains=armgcc, cores=cm33, device_ids=MIMXRT685S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT685S/gcc/MIMXRT685Sxxxx_cm33_flash_ns.ld" version="1.0.0" projectpath="MIMXRT685S/gcc"/>
        <file condition="allOf.toolchains=iar, cores=cm33, device_ids=MIMXRT685S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT685S/iar/MIMXRT685Sxxxx_cm33_ram.icf" version="1.0.0" projectpath="MIMXRT685S/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, device_ids=MIMXRT685S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT685S/iar/MIMXRT685Sxxxx_cm33_flash.icf" version="1.0.0" projectpath="MIMXRT685S/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, device_ids=MIMXRT685S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT685S/iar/MIMXRT685Sxxxx_cm33_ram_s.icf" version="1.0.0" projectpath="MIMXRT685S/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, device_ids=MIMXRT685S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT685S/iar/MIMXRT685Sxxxx_cm33_flash_s.icf" version="1.0.0" projectpath="MIMXRT685S/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, device_ids=MIMXRT685S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT685S/iar/MIMXRT685Sxxxx_cm33_ram_ns.icf" version="1.0.0" projectpath="MIMXRT685S/iar"/>
        <file condition="allOf.toolchains=iar, cores=cm33, device_ids=MIMXRT685S.condition_id" category="linkerScript" attr="config" name="devices/MIMXRT685S/iar/MIMXRT685Sxxxx_cm33_flash_ns.icf" version="1.0.0" projectpath="MIMXRT685S/iar"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MIMXRT685S" Cversion="1.0.0" condition="device.project_template.condition_id" isDefaultVariant="1">
      <description>Devices_project_template MIMXRT685S</description>
      <files>
        <file category="header" attr="config" name="devices/MIMXRT685S/project_template/board.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT685S/project_template/board.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT685S/project_template/clock_config.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT685S/project_template/clock_config.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT685S/project_template/pin_mux.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT685S/project_template/pin_mux.c" version="1.0.0" projectpath="board"/>
        <file category="header" attr="config" name="devices/MIMXRT685S/project_template/peripherals.h" version="1.0.0" projectpath="board"/>
        <file category="sourceC" attr="config" name="devices/MIMXRT685S/project_template/peripherals.c" version="1.0.0" projectpath="board"/>
        <file category="include" name="devices/MIMXRT685S/project_template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="" Cversion="1.0.0" condition="device.startup.condition_id">
      <description>Device MIMXRT685S_startup</description>
      <files>
        <file condition="allOf.toolchains=iar, core_ids=cm33.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT685S/iar/startup_MIMXRT685S_cm33.s" version="1.0.0" projectpath="startup/iar"/>
        <file condition="allOf.toolchains=armgcc, core_ids=cm33.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT685S/gcc/startup_MIMXRT685S_cm33.S" version="1.0.0" projectpath="startup/gcc"/>
        <file condition="allOf.toolchains=mdk, core_ids=cm33.condition_id" category="sourceAsm" attr="config" name="devices/MIMXRT685S/arm/startup_MIMXRT685S_cm33.S" version="1.0.0" projectpath="startup/arm"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="MIMXRT685S_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MIMXRT685S_system</description>
      <files>
        <file condition="allOf.core_ids=cm33.condition_id" category="sourceC" name="devices/MIMXRT685S/system_MIMXRT685S_cm33.c" projectpath="device"/>
        <file condition="allOf.core_ids=cm33.condition_id" category="header" name="devices/MIMXRT685S/system_MIMXRT685S_cm33.h" projectpath="device"/>
        <file category="include" name="devices/MIMXRT685S/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="acmp" Cversion="2.3.0" condition="driver.acmp.condition_id">
      <description>ACMP Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT685S/drivers/fsl_acmp.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT685S/drivers/fsl_acmp.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT685S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ak4497" Cversion="2.1.2" condition="driver.ak4497.condition_id">
      <description>Driver ak4497</description>
      <RTE_Components_h>
#ifndef CODEC_AK4497_ENABLE
#define CODEC_AK4497_ENABLE 
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/codec/ak4497/fsl_ak4497.h" projectpath="codec"/>
        <file category="sourceC" name="components/codec/ak4497/fsl_ak4497.c" projectpath="codec"/>
        <file category="include" name="components/codec/ak4497/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="cache_cache64" Cversion="2.0.11" condition="driver.cache_cache64.condition_id">
      <description>CACHE Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT685S/drivers/fsl_cache.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT685S/drivers/fsl_cache.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT685S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="casper" Cversion="2.2.4" condition="driver.casper.condition_id">
      <description>CASPER Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT685S/drivers/fsl_casper.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT685S/drivers/fsl_casper.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT685S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.7.4" condition="driver.clock.condition_id">
      <description>Clock Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT685S/drivers/fsl_clock.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT685S/drivers/fsl_clock.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT685S/drivers/"/>
      </files>
    </component>
