vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MIMXRT685S_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi" Cversion="2.8.0" condition="driver.flexspi.condition_id">
      <description>FLEXSPI Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT685S/drivers/fsl_flexspi.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT685S/drivers/fsl_flexspi.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT685S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="flexspi_dma" Cversion="2.2.1" condition="driver.flexspi_dma.condition_id">
      <description>FLEXSPI DMA Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT685S/drivers/fsl_flexspi_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT685S/drivers/fsl_flexspi_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT685S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fmeas" Cversion="2.1.1" condition="driver.fmeas.condition_id">
      <description>FMEAS Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT685S/drivers/fsl_fmeas.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT685S/drivers/fsl_fmeas.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT685S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ft3267" Cversion="1.0.1" condition="driver.ft3267.condition_id">
      <description>Touch panel controller FT3267 driver</description>
      <files>
        <file category="header" name="components/touch/ft3267/fsl_ft3267.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/ft3267/fsl_ft3267.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/ft3267/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ft5406" Cversion="1.0.0" condition="driver.ft5406.condition_id">
      <description>Driver ft5406</description>
      <files>
        <file category="header" name="components/touch/ft5406/fsl_ft5406.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/ft5406/fsl_ft5406.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/ft5406/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ft6x06" Cversion="1.0.0" condition="driver.ft6x06.condition_id">
      <description>Driver ft6x06</description>
      <files>
        <file category="header" name="components/touch/ft6x06/fsl_ft6x06.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/ft6x06/fsl_ft6x06.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/ft6x06/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fxas21002cq" Cversion="1.0.0" condition="driver.fxas21002cq.condition_id">
      <description>Driver fxas21002cq</description>
      <files>
        <file category="header" name="components/sensor/fxas21002cq/fsl_fxas.h" projectpath="gyroscope"/>
        <file category="sourceC" name="components/sensor/fxas21002cq/fsl_fxas.c" projectpath="gyroscope"/>
        <file category="include" name="components/sensor/fxas21002cq/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fxls8974cf" Cversion="1.0.0" condition="driver.fxls8974cf.condition_id">
      <description>Driver fxls8974cf</description>
      <files>
        <file category="header" name="components/sensor/fxls8974cf/fsl_fxls.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/fxls8974cf/fsl_fxls.c" projectpath="accel"/>
        <file category="include" name="components/sensor/fxls8974cf/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="fxos8700cq" Cversion="1.0.0" condition="driver.fxos8700cq.condition_id">
      <description>Driver fxos8700cq</description>
      <files>
        <file category="header" name="components/sensor/fxos8700cq/fsl_fxos.h" projectpath="accel"/>
        <file category="sourceC" name="components/sensor/fxos8700cq/fsl_fxos.c" projectpath="accel"/>
        <file category="include" name="components/sensor/fxos8700cq/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="gt911" Cversion="1.0.4" condition="driver.gt911.condition_id">
      <description>Driver gt911</description>
      <RTE_Components_h>
        #ifndef SDK_I2C_BASED_COMPONENT_USED
        #define SDK_I2C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="header" name="components/touch/gt911/fsl_gt911.h" projectpath="touchpanel"/>
        <file category="sourceC" name="components/touch/gt911/fsl_gt911.c" projectpath="touchpanel"/>
        <file category="include" name="components/touch/gt911/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="hashcrypt" Cversion="2.2.17" condition="driver.hashcrypt.condition_id">
      <description>Hashcrypt Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT685S/drivers/fsl_hashcrypt.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT685S/drivers/fsl_hashcrypt.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT685S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="htu21d" Cversion="1.0.0" condition="driver.htu21d.condition_id">
      <description>Driver htu21d</description>
      <files>
        <file category="header" name="components/sensor/htu21d/fsl_htu21d.h" projectpath="htu"/>
        <file category="sourceC" name="components/sensor/htu21d/fsl_htu21d.c" projectpath="htu"/>
        <file category="include" name="components/sensor/htu21d/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2s_bridge" Cversion="2.0.0" condition="driver.i2s_bridge.condition_id">
      <description>I2S Bridge Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT685S/drivers/fsl_i2s_bridge.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT685S/drivers/fsl_i2s_bridge.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT685S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i3c" Cversion="2.14.2" condition="driver.i3c.condition_id">
      <description>I3C Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT685S/drivers/fsl_i3c.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT685S/drivers/fsl_i3c.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT685S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i3c_dma" Cversion="2.1.8" condition="driver.i3c_dma.condition_id">
      <description>I3C DMA Driver</description>
      <files>
        <file category="sourceC" name="devices/MIMXRT685S/drivers/fsl_i3c_dma.c" projectpath="drivers"/>
        <file category="header" name="devices/MIMXRT685S/drivers/fsl_i3c_dma.h" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT685S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="iap3" Cversion="2.1.3" condition="driver.iap3.condition_id">
      <description>IAP3 Driver</description>
      <files>
        <file category="header" name="devices/MIMXRT685S/drivers/fsl_iap.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MIMXRT685S/drivers/fsl_iap.c" projectpath="drivers"/>
        <file category="include" name="devices/MIMXRT685S/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="icm42688p" Cversion="1.0.0" condition="driver.icm42688p.condition_id">
      <description>Driver icm42688p</description>
      <files>
        <file category="header" name="components/sensor/icm42688p/fsl_icm42688p.h" projectpath="icm42688p"/>
        <file category="sourceC" name="components/sensor/icm42688p/fsl_icm42688p.c" projectpath="icm42688p"/>
        <file category="include" name="components/sensor/icm42688p/"/>
      </files>
    </component>
